:PROPERTIES:
:ID:       305C1F31-5238-4E38-BE9E-54512B29D322
:END:
#+title: asset-flo
* information
** server
5.189.160.91
user: root
password:j6jK8iVTZJhSN99
* tasks
** reading and learning documents
:LOGBOOK:
CLOCK: [2025-08-11 Mon 10:59]--[2025-08-11 Mon 11:57] =>  0:58
CLOCK: [2025-08-08 Fri 12:10]--[2025-08-08 Fri 14:00] =>  1:50
CLOCK: [2025-08-08 Fri 10:12]--[2025-08-08 Fri 11:27] =>  1:15
CLOCK: [2025-08-07 Thu 22:10]--[2025-08-07 Thu 22:45] =>  0:35
CLOCK: [2025-08-07 Thu 11:00]--[2025-08-07 Thu 11:45] =>  0:45
:END:
*** meta
**** figure out how we are going to connect to Meta
**** figure out how we are going to list assets connected to a meta account
**** figure out how to collect performance of a asset in meta
*** figure out AI analysis pipline
https://g.co/gemini/share/056227ca6797
** Reading the Documents and preparing access
** setting up the project
:LOGBOOK:
CLOCK: [2025-11-13 Thu 18:28]--[2025-11-13 Thu 20:47] =>  2:19
CLOCK: [2025-11-10 Mon 18:27]--[2025-11-10 Mon 20:28] =>  2:01
CLOCK: [2025-11-08 Sat 15:28]--[2025-11-08 Sat 18:39] =>  3:11
CLOCK: [2025-10-31 Fri 10:45]--[2025-10-31 Fri 11:43] =>  0:58
CLOCK: [2025-10-31 Fri 09:15]--[2025-10-31 Fri 09:45] =>  0:30
CLOCK: [2025-10-31 Fri 06:40]--[2025-10-31 Fri 08:38] =>  1:58
:END:
*** DELEGATED get access to access token                              :admin:
:LOGBOOK:
- State "DELEGATED"  from "DONE"       [2025-10-31 Fri 09:03]
- State "DONE"       from "TODO"       [2025-10-31 Fri 09:03]
- State "TODO"       from              [2025-10-31 Fri 09:01]
:END:
** get proper access to facebook
*** DELEGATED set up facebook account                                 :admin:
:LOGBOOK:
- State "DELEGATED"  from              [2025-10-31 Fri 09:02]
:END:
*** DELEGATED set up associated gmail account                         :admin:
:LOGBOOK:
- State "DELEGATED"  from              [2025-10-31 Fri 09:02]
:END:
*** ask admin to add FACEBOOK_REDIRECT_URI to whitelist urls
FACEBOOK_REDIRECT_URI=http://localhost:3000/auth/meta/callback
** setting up server
:LOGBOOK:
CLOCK: [2025-10-31 Fri 09:45]--[2025-10-31 Fri 10:01] =>  0:16
CLOCK: [2025-10-31 Fri 08:38]--[2025-10-31 Fri 08:58] =>  0:20
:END:
** meeting 
:LOGBOOK:
CLOCK: [2025-10-31 Fri 11:30]--[2025-10-31 Fri 12:09] =>  0:39
:END:
